<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

## Guided Practice: Inspecting Data Types and Applying Functions

_Authors: Dave Yerrington (SF)_

---

In [167]:
import pandas as pd
import numpy as np

**1. Create a small DataFrame with different data types (provided).**

In [168]:
# create a small dictionary with different data types

dft = pd.DataFrame(dict(A = np.random.rand(3),
                        B = 1,
                        C = 'foo',
                        D = pd.Timestamp('20010102'),
                        E = pd.Series([1.0]*3).astype('float32'),
                                F = False,
                                G = pd.Series([1]*3,dtype='int8')))

# print(dict(A = np.random.rand(3),
#                         B = 1,
#                         C = 'foo',
#                         D = pd.Timestamp('20010102'),
#                         E = pd.Series([1.0]*3).astype('float32'),
#                                 F = False,
#                                 G = pd.Series([1]*3,dtype='int8')))

dft

          A  B    C          D    E      F  G
0  0.414728  1  foo 2001-01-02  1.0  False  1
1  0.013066  1  foo 2001-01-02  1.0  False  1
2  0.317626  1  foo 2001-01-02  1.0  False  1

**2. Examine the data types of the columns.**

In [169]:
# A:
dft.dtypes

A           float64
B             int64
C            object
D    datetime64[ns]
E           float32
F              bool
G              int8
dtype: object

**3. Create a Series object with the integers 1-5 and float 6.0. What data type is the Series?**

In [170]:
# A:
series_one = pd.Series([1, 2, 3, 4, 5, 6.0])
series_one

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
dtype: float64

**4. Create a Series with data: `[1, 2, 3, 6., 'foo']`. What data type is the series?**

In [171]:
# A:
series_two = pd.Series([1, 2, 3, 6., 'foo'])
series_two

0      1
1      2
2      3
3      6
4    foo
dtype: object

**5. Find how many columns of each type there are with the `.get_dtype_counts()` function.**

In [172]:
# A: the function returns how many **COLUMNS** (or Series objects in the DF) are there for each dtype
print(dft.get_dtype_counts())

bool              1
datetime64[ns]    1
float32           1
float64           1
int64             1
int8              1
object            1
dtype: int64

**6. Create another small DataFrame (provided).**

In [173]:
# create a small data frame. 
df = pd.DataFrame(np.random.randn(5, 4), columns=['a', 'b', 'c', 'd'])

**7. Use the `.apply()` function to find the square root of all the cells.**

In [174]:
# A:
df.apply(np.sqrt)

          a         b         c         d
0  0.454042       NaN  0.508056       NaN
1  0.147758       NaN       NaN  1.368569
2  0.397359       NaN  0.710619  0.952719
3       NaN       NaN       NaN       NaN
4       NaN  0.979899       NaN  0.549979

**8. Use `.apply()` to find the mean of the columns.**

In [175]:
# A:
df.apply(np.mean, axis='rows')

a   -0.129892
b   -0.006071
c   -0.321419
d    0.180601
dtype: float64

**9. Find the mean of the rows.**

In [176]:
# A:
df.apply(np.mean, axis='columns')

0   -0.296458
1    0.213456
2    0.292822
3   -0.465001
4   -0.090794
dtype: float64

**10. Use numpy to create a random vector of 50 numbers ranging from 0 to 6.**

*Hint: This can be done with `np.random.randint()`.

In [177]:
# A:
random_np = np.random.randint(low=0, high=6, size=(50))
random_np

array([4, 0, 5, 5, 0, 0, 4, 3, 0, 4, 2, 3, 1, 4, 0, 3, 1, 0, 3, 0, 5, 3,
       3, 0, 2, 5, 4, 2, 5, 4, 2, 4, 1, 1, 3, 0, 4, 2, 0, 4, 4, 2, 0, 0,
       4, 5, 2, 2, 3, 0])

**11. Convert the vector to a Series and count the occurrences of each number.**

In [178]:
# A:
# Convert vector to a Series
random_series = pd.Series(random_np)

# Count occurrences of each number
random_series.value_counts()

0    13
4    11
3     8
2     8
5     6
1     4
dtype: int64

---

# Independent practice: sales data

---
**1. Load the `sales.csv` data set from the datasets directory.**

In [179]:
# A:
sales_pd = pd.read_csv("datasets/sales.csv")
sales_pd.head()

   volume_sold  2015_margin  2015_q1_sales  2016_q1_sales
0    18.420760    93.802281      337166.53      337804.05
1     4.776510    21.082425       22351.86       21736.63
2    16.602401    93.612494      277764.46      306942.27
3     4.296111    16.824704       16805.11        9307.75
4     8.156023    35.011457       54411.42       58939.90

**2. Inspect the data types.**

In [180]:
# A:
sales_pd.dtypes

volume_sold      float64
2015_margin      float64
2015_q1_sales    float64
2016_q1_sales    float64
dtype: object

**3. Imagine you've found out that all your values in the first column are off by 1. Use `.apply()` or `.map()` to add 1 to the first column of the dataset.**

In [181]:
# A:
sales_pd.iloc[:, [0]] = sales_pd.iloc[:, [0]].apply(lambda cell_value: cell_value + 1)
sales_pd.head()

   volume_sold  2015_margin  2015_q1_sales  2016_q1_sales
0    19.420760    93.802281      337166.53      337804.05
1     5.776510    21.082425       22351.86       21736.63
2    17.602401    93.612494      277764.46      306942.27
3     5.296111    16.824704       16805.11        9307.75
4     9.156023    35.011457       54411.42       58939.90

**4. Use `.value_counts` to count the values of the first column of the dataset.**

In [182]:
# A:
sales_pd.iloc[:, 0].value_counts()

17.059971    1
12.232324    1
7.290971     1
14.635150    1
6.047530     1
6.906274     1
7.618174     1
10.292241    1
5.200122     1
4.210727     1
12.997117    1
8.200364     1
46.556096    1
6.778097     1
5.385455     1
11.804337    1
9.017945     1
16.697651    1
7.654407     1
9.300180     1
7.537069     1
7.433606     1
5.776510     1
11.186622    1
9.156023     1
6.531061     1
6.294400     1
12.697456    1
15.439435    1
8.390988     1
            ..
8.682494     1
10.127095    1
11.292681    1
6.324497     1
5.296111     1
10.348477    1
13.581695    1
13.395919    1
52.800686    1
12.625606    1
11.677295    1
11.252870    1
5.941294     1
15.606750    1
30.878030    1
11.331430    1
8.434821     1
8.196779     1
8.785867     1
12.091709    1
13.509967    1
6.147729     1
13.350027    1
6.388070     1
9.555078     1
12.840780    1
6.723896     1
8.437252     1
5.456466     1
11.705327    1
Name: volume_sold, Length: 200, dtype: int64

**BONUS: The `.value_counts()` output in question four isn't very insightful.  Use [Pandas.DataFrame.round](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.round.html) to round the column to the nearest tenth before runing `.value_counts()`.**

In [183]:
# A:
sales_pd.iloc[:, 0].round(decimals=1).value_counts()

7.3     7
11.3    6
9.6     6
8.8     6
8.4     5
10.3    5
5.8     4
11.1    4
6.2     4
11.7    3
6.9     3
8.2     3
8.6     3
9.2     3
5.4     3
9.5     3
6.8     3
7.7     3
13.5    3
7.0     3
9.8     3
6.0     3
11.6    3
5.9     3
12.1    3
9.4     3
9.1     3
10.2    2
10.4    2
8.7     2
       ..
13.1    1
4.2     1
7.1     1
19.7    1
15.6    1
5.3     1
11.9    1
56.7    1
77.2    1
7.2     1
51.3    1
3.8     1
52.8    1
17.1    1
4.1     1
4.6     1
10.9    1
10.7    1
30.9    1
9.7     1
10.1    1
14.8    1
6.4     1
4.7     1
46.6    1
5.6     1
52.7    1
17.6    1
19.4    1
12.2    1
Name: volume_sold, Length: 99, dtype: int64